{
    "reviews": [
      {
        "professor": "Dr. Sarah Chen",
        "subject": "Computer Science",
        "stars": 5,
        "review": "Dr. Chen is an exceptional professor. Her lectures are engaging and she explains complex concepts clearly."
      },
      {
        "professor": "Prof. Michael Rodriguez",
        "subject": "History",
        "stars": 4,
        "review": "Prof. Rodriguez brings history to life with his passionate teaching style. Sometimes his assignments can be overwhelming."
      },
      {
        "professor": "Dr. Emily Watson",
        "subject": "Biology",
        "stars": 5,
        "review": "Dr. Watson's labs are incredibly well-organized. She's always available for extra help and genuinely cares about student success."
      },
      {
        "professor": "Prof. David Kim",
        "subject": "Mathematics",
        "stars": 3,
        "review": "Prof. Kim is knowledgeable, but his teaching style can be confusing. Office hours are helpful for clarification."
      },
      {
        "professor": "Dr. Lisa Patel",
        "subject": "Psychology",
        "stars": 5,
        "review": "Dr. Patel's lectures are fascinating. She incorporates real-world examples that make the material easy to understand and remember."
      },
      {
        "professor": "Prof. Robert Johnson",
        "subject": "English Literature",
        "stars": 4,
        "review": "Prof. Johnson's passion for literature is contagious. His essay prompts are challenging but thought-provoking."
      },
      {
        "professor": "Dr. Maria Gonzalez",
        "subject": "Chemistry",
        "stars": 5,
        "review": "Dr. Gonzalez explains complex chemical concepts with ease. Her problem-solving sessions are invaluable."
      },
      {
        "professor": "Prof. Thomas Lee",
        "subject": "Economics",
        "stars": 2,
        "review": "Prof. Lee's lectures are dry and hard to follow. The textbook is more helpful than his classes."
      },
      {
        "professor": "Dr. Rachel Cohen",
        "subject": "Sociology",
        "stars": 4,
        "review": "Dr. Cohen encourages critical thinking and class discussions. Her grading can be harsh, but feedback is always constructive."
      },
      {
        "professor": "Prof. James Wilson",
        "subject": "Physics",
        "stars": 3,
        "review": "Prof. Wilson knows his subject well, but sometimes struggles to explain concepts to non-physics majors."
      },
      {
        "professor": "Dr. Olivia Brown",
        "subject": "Art History",
        "stars": 5,
        "review": "Dr. Brown's lectures are like guided tours through art museums. Her enthusiasm for the subject is infectious."
      },
      {
        "professor": "Prof. Alexander Ivanov",
        "subject": "Political Science",
        "stars": 4,
        "review": "Prof. Ivanov presents balanced viewpoints on complex political issues. His debates are engaging and thought-provoking."
      },
      {
        "professor": "Dr. Samantha Taylor",
        "subject": "Environmental Science",
        "stars": 5,
        "review": "Dr. Taylor's field trips and hands-on experiments make learning about the environment exciting and relevant."
      },
      {
        "professor": "Prof. William Chang",
        "subject": "Philosophy",
        "stars": 3,
        "review": "Prof. Chang's lectures can be abstract and difficult to follow, but his office hours are very helpful."
      },
      {
        "professor": "Dr. Jessica Martinez",
        "subject": "Neuroscience",
        "stars": 5,
        "review": "Dr. Martinez is at the forefront of her field. Her lectures are challenging but incredibly rewarding."
      },
      {
        "professor": "Prof. Daniel Green",
        "subject": "Marketing",
        "stars": 4,
        "review": "Prof. Green brings real-world marketing experience to the classroom. His group projects are excellent preparation for the industry."
      },
      {
        "professor": "Dr. Laura Anderson",
        "subject": "Anthropology",
        "stars": 5,
        "review": "Dr. Anderson's storytelling approach to anthropology makes every lecture captivating. Her assignments encourage creative thinking."
      },
      {
        "professor": "Prof. Christopher Wong",
        "subject": "Statistics",
        "stars": 2,
        "review": "Prof. Wong rushes through material too quickly. It's difficult to keep up with his pace during lectures."
      },
      {
        "professor": "Dr. Natalie Richards",
        "subject": "Linguistics",
        "stars": 4,
        "review": "Dr. Richards makes the study of language fascinating. Her assignments can be challenging, but they're always enlightening."
      },
      {
        "professor": "Prof. Adam Foster",
        "subject": "Music Theory",
        "stars": 5,
        "review": "Prof. Foster's passion for music is evident in every lecture. He makes complex theoretical concepts accessible and enjoyable."
      }
    ]
  }